//: version "2.0"
//: property title = "edit1_tut.v"
//: property useExtBars = 0
//: property discardChanges = 1

module main;    //: root_module
wire w7;    //: /sn:0 {0}(682,363)(697,363)(697,375){1}
wire s0;    //: {0}(750,310)(780,310){1}
wire w4;    //: /sn:0 {0}(702,345)(702,375){1}
wire c0;    //: {0}(598,268)(704,268)(704,310){1}
//: {2}(706,312)(729,312){3}
//: {4}(704,314)(704,324){5}
wire c1;    //: {0}(700,396)(700,433){1}
//: {2}(702,435)(725,435){3}
//: {4}(700,437)(700,447){5}
wire s1;    //: /dp:1 {0}(746,433)(781,433){1}
wire a1;    //: {0}(598,427)(638,427){1}
//: {2}(642,427)(650,427){3}
//: {4}(640,429)(640,483)(657,483){5}
wire b1;    //: {0}(598,462)(632,462){1}
//: {2}(634,460)(634,432)(650,432){3}
//: {4}(634,464)(634,488)(657,488){5}
wire w8;    //: /sn:0 {0}(678,486)(693,486)(693,498){1}
wire a0;    //: /dp:1 {0}(598,304)(642,304){1}
//: {2}(646,304)(654,304){3}
//: {4}(644,306)(644,360)(661,360){5}
wire b0;    //: /dp:1 {0}(598,339)(636,339){1}
//: {2}(638,337)(638,309)(654,309){3}
//: {4}(638,341)(638,365)(661,365){5}
wire c2;    //: {0}(783,530)(696,530)(696,519){1}
wire w10;    //: /sn:0 {0}(725,430)(697,430){1}
//: {2}(693,430)(671,430){3}
//: {4}(695,432)(695,447){5}
wire w5;    //: /sn:0 {0}(698,468)(698,498){1}
wire w9;    //: /sn:0 {0}(729,307)(701,307){1}
//: {2}(697,307)(675,307){3}
//: {4}(699,309)(699,324){5}
//: enddecls

  //: joint g8 (c1) @(700, 435) /w:[ 2 1 -1 4 ]
  nand g4 (.I0(w8), .I1(w5), .Z(c2));   //: @(696,509) /sn:0 /R:3 /w:[ 1 1 1 ]
  //: comment g61 /dolink:1 /link:"@T/edwire_tut.v" @(622,100) /sn:0
  //: /line:"ワイヤの編集"
  //: /end
  led g37 (.I(s0));   //: @(787,310) /sn:0 /R:3 /w:[ 1 ] /type:0
  xor g34 (.I0(w10), .I1(c1), .Z(s1));   //: @(736,433) /sn:0 /w:[ 0 3 0 ]
  //: comment g3 /dolink:0 /link:"" @(29,249) /anc:1
  //: /line:"5) 「ツール」メニューの「ビット幅」を選択して、リボンケーブルのツールを出し"
  //: /line:"て下さい。そうすると、ウィンドウ右下に「ビット幅」の入力ボックスが出ます。"
  //: /line:"ボックスをクリックして、1〜32の数字を入力して下さい。それからワイヤを"
  //: /line:"クリックして、示しているビット幅に設定してみて下さい。"
  //: /line:""
  //: /line:"6) 「ツール」メニューの「移動／接続」を選択し、ワイヤをダブル・クリックする"
  //: /line:"と、属性ボックスが開きます。ネット名、ネット名を表示するかどうか、ビット幅"
  //: /line:"などの属性が設定できます。マウスの右ボタンのメニューでも設定できます。"
  //: /line:""
  //: /line:"7) ORゲートなどをダブル・クリックすると、ゲートの属性ボックスが開きます。"
  //: /line:"ゲート名、ゲート名を表示するかどうか、ゲートが移動出来るかどうかなどの"
  //: /line:"属性が設定出来ます。ポートの追加、削除、編集なども出来ます。"
  //: /line:""
  //: /line:"8) ゲートをマウス右ボタンでクリックして、「移動不可」のフラグをセットして"
  //: /line:"みて下さい。このフラグがセットしてあれば、ゲートの移動は出来ません。"
  //: /end
  //: comment g2 /dolink:0 /link:"" @(29,38) /anc:1
  //: /line:"1) マウスの左ボタンでゲートをクリックし、ボタンを押したまま別の場所に移動"
  //: /line:"してみて下さい。ゲートに繋いでいるワイヤも一緒に移動します。"
  //: /line:""
  //: /line:"2) 「ツール」メニューの「ワイヤの切断」を選択して、カッターのツールを"
  //: /line:"出し、ワイヤのどこかをクリックしてみて下さい。何にも繋いでいないワイヤの"
  //: /line:"部分は自動的に削除されます。マウス右ボタンで開くメニューを利用しても"
  //: /line:"カッターを出せます。"
  //: /line:""
  //: /line:"3) 「ツール」メニューの「否定」を選択して、否定ツールを出し、ゲートの"
  //: /line:"入力や出力をクリックしてみて下さい。否定の丸が現れたり、消えたりします。"
  //: /line:""
  //: /line:"4) 「ツール」メニューの「ゲートの削除」を選択し、ゲートをクリックしてみて"
  //: /line:"下さい。ゲートが削除されます。ゲートを選択して、デリート・キーを押したり、"
  //: /line:"マウス右ボタンで「削除」を選択したりすることでもゲートが削除できます。"
  //: /end
  nand g1 (.I0(w7), .I1(w4), .Z(c1));   //: @(700,386) /sn:0 /R:3 /w:[ 1 1 0 ]
  //: switch g11 (a1) @(581,427) /sn:0 /w:[ 0 ] /st:0
  //: comment g16 /dolink:1 /link:"@T/module_tut.v" @(622,115) /sn:0
  //: /line:"モジュールの使い方"
  //: /end
  //: joint g10 (a1) @(640, 427) /w:[ 2 -1 1 4 ]
  nand g28 (.I0(a0), .I1(b0), .Z(w7));   //: @(672,363) /sn:0 /w:[ 5 5 0 ]
  led g19 (.I(s1));   //: @(788,433) /sn:0 /R:3 /w:[ 1 ] /type:0
  //: switch g27 (c0) @(581,268) /sn:0 /w:[ 0 ] /st:0
  //: joint g32 (w9) @(699, 307) /w:[ 1 -1 2 4 ]
  //: joint g38 (b1) @(634, 462) /w:[ -1 2 1 4 ]
  nand g6 (.I0(a1), .I1(b1), .Z(w8));   //: @(668,486) /sn:0 /w:[ 5 5 0 ]
  nand g9 (.I0(w10), .I1(c1), .Z(w5));   //: @(698,458) /sn:0 /R:3 /w:[ 5 5 0 ]
  //: joint g7 (w10) @(695, 430) /w:[ 1 -1 2 4 ]
  nand g31 (.I0(w9), .I1(c0), .Z(w4));   //: @(702,335) /sn:0 /R:3 /w:[ 5 5 0 ]
  //: frame g15 @(600,25) /sn:0 /wi:224 /ht:149 /tx:"チュートリアル"
  //: comment g20 /dolink:1 /link:"@T/create_tut.v" @(622,55) /sn:0
  //: /line:"回路の作成"
  //: /end
  led g39 (.I(c2));   //: @(790,530) /sn:0 /R:3 /w:[ 0 ] /type:0
  //: switch g25 (a0) @(581,304) /sn:0 /w:[ 0 ] /st:0
  //: joint g29 (a0) @(644, 304) /w:[ 2 -1 1 4 ]
  //: comment g17 /dolink:1 /link:"@T/sim_tut.v" @(622,130) /sn:0
  //: /line:"組合せ回路のシミュレーション"
  //: /end
  //: comment g5 /dolink:0 /link:"@T/edit1_tut.v" @(622,70) /sn:0 /anc:1
  //: /line:"基本の編集モード"
  //: /end
  //: comment g14 /dolink:1 /link:"@T/seqsim_tut.v" @(622,145) /sn:0
  //: /line:"順序回路のシミュレーション"
  //: /end
  //: switch g36 (b1) @(581,462) /sn:0 /w:[ 0 ] /st:0
  xor g24 (.I0(w9), .I1(c0), .Z(s0));   //: @(740,310) /sn:0 /w:[ 0 3 0 ]
  //: comment g21 /dolink:1 /link:"@T/edit2_tut.v" @(622,85) /sn:0
  //: /line:"グループの編集機能"
  //: /end
  xor g23 (.I0(a0), .I1(b0), .Z(w9));   //: @(665,307) /sn:0 /w:[ 3 3 3 ]
  xor g35 (.I0(a1), .I1(b1), .Z(w10));   //: @(661,430) /sn:0 /w:[ 3 3 3 ]
  //: comment g0 /dolink:0 /link:"" @(8,10) /anc:1
  //: /line:"このチュートリアルでは、TkGateの基本編集機能を紹介する。"
  //: /line:""
  //: /end
  //: switch g26 (b0) @(581,339) /sn:0 /w:[ 0 ] /st:0
  //: comment g22 /dolink:0 /link:"" @(605,70) /sn:0
  //: /line:"->"
  //: /end
  //: comment g18 /dolink:1 /link:"@T/welcome_tut.v" @(622,40) /sn:0
  //: /line:"TkGateの紹介"
  //: /end
  //: joint g30 (b0) @(638, 339) /w:[ -1 2 1 4 ]
  //: joint g33 (c0) @(704, 312) /w:[ 2 1 -1 4 ]

endmodule
